// products-data.js (ملف بيانات المنتجات)

const ALL_PRODUCTS = [
    {
        id: 1, // هذا هو ID الكنزة الهودي الأولى
        category: "all_clothes",
        name: "كنزة هودي",
        description: "رفيقك المثالي للأيام الباردة. هودي قطنية ناعمة بتصميم عصري يجمع بين الأناقة والراحة المطلقة.",
        price: 4.99,
        image: "img/t1.jpg",
        colors: [
            {
                name: "اصفر",
                hex: "yellow", // كود اللون (للعرض في الزر)
                image: "img/t1.jpg" // مسار صورة الكنزة باللون الأسود
            },
            {
                name: "اورانج",
                hex: "#f36f28",
                image: "img/t2.jpg" // مسار صورة الكنزة باللون الأسود
                // image_set: [ 
                    // "img/t2.jpg", // الصورة الأولى (الصدر)
                    // "img/t5.jpg",  // الصورة الثانية (من الخلف)
                // ]
            },
            {
                name: "اسود",
                hex: "#black",
                image: "img/t3.jpg" // مسار صورة الكنزة باللون الكحلي
            }
        ],
    },
    {
        id: 2, // هذا هو ID البنطلون
        category: "man",
        name: "بنطلون",
        description: "تصميم عصري يمنحك حرية الحركة الكاملة. بنطلون مثالي يجمع بين الراحة اليومية والأناقة البسيطة.",
        price: 4.99,
        image: "img/b1.jpg",
         colors: [
     {
         name: "اصفر",
         hex: "yellow", // كود اللون (للعرض في الزر)
         image: "img/t1.jpg" // مسار صورة الكنزة باللون الأسود
     },
     {
         name: "اورانج",
         hex: "#f36f28",
         image: "img/t2.jpg" // مسار صورة الكنزة باللون الرمادي
     },
     {
         name: "اسود",
         hex: "#black",
         image: "img/t3.jpg" // مسار صورة الكنزة باللون الكحلي
     }
 ],
    },
    {
        id: 3, // هذا هو ID الكنزة الهودي الثالثة
        category: "women",
        name: "كنزة هودي",
        description: "رفيقك المثالي للأيام الباردة. هودي قطنية ناعمة بتصميم عصري يجمع بين الأناقة والراحة المطلقة.",
        price: 4.99,
        image: "img/t5.jpg",
         colors: [
     {
         name: "اصفر",
         hex: "yellow", // كود اللون (للعرض في الزر)
         image: "img/t1.jpg" // مسار صورة الكنزة باللون الأسود
     },
     {
         name: "اورانج",
         hex: "#f36f28",
         image: "img/t2.jpg" // مسار صورة الكنزة باللون الرمادي
     },
     {
         name: "اسود",
         hex: "#black",
         image: "img/t3.jpg" // مسار صورة الكنزة باللون الكحلي
     }
 ],
    },
    {
        id: 4, // هذا هو ID الكنزة الهودي الرابعة
        category: "all_clothes",
        name: "كنزة هودي",
        description: "رفيقك المثالي للأيام الباردة. هودي قطنية ناعمة بتصميم عصري يجمع بين الأناقة والراحة المطلقة.",
        price: 4.99,
        image: "img/t2.jpg",
         colors: [
     {
         name: "اصفر",
         hex: "yellow", // كود اللون (للعرض في الزر)
         image: "img/t1.jpg" // مسار صورة الكنزة باللون الأسود
     },
     {
         name: "اورانج",
         hex: "#f36f28",
         image: "img/t2.jpg" // مسار صورة الكنزة باللون الرمادي
     },
     {
         name: "اسود",
         hex: "#black",
         image: "img/t3.jpg" // مسار صورة الكنزة باللون الكحلي
     }
 ],
    },

    {
    id: 5, // هذا هو ID الكنزة الهودي الأولى
    category: "all_clothes",
    name: "كنزة هودي",
    description: "رفيقك المثالي للأيام الباردة. هودي قطنية ناعمة بتصميم عصري يجمع بين الأناقة والراحة المطلقة.",
    price: 4.99,
    image: "img/t1.jpg",
     colors: [
     {
         name: "اصفر",
         hex: "yellow", // كود اللون (للعرض في الزر)
         image: "img/t1.jpg" // مسار صورة الكنزة باللون الأسود
     },
     {
         name: "اورانج",
         hex: "#f36f28",
         image: "img/t2.jpg" // مسار صورة الكنزة باللون الرمادي
     },
     {
         name: "اسود",
         hex: "#black",
         image: "img/t3.jpg" // مسار صورة الكنزة باللون الكحلي
     }
 ],
},
{
    id: 6, // هذا هو ID البنطلون
    category: "all_clothes",
    name: "بنطلون",
    description: "تصميم عصري يمنحك حرية الحركة الكاملة. بنطلون مثالي يجمع بين الراحة اليومية والأناقة البسيطة.",
    price: 4.99,
    image: "img/b1.jpg",
     colors: [
     {
         name: "اصفر",
         hex: "yellow", // كود اللون (للعرض في الزر)
         image: "img/t1.jpg" // مسار صورة الكنزة باللون الأسود
     },
     {
         name: "اورانج",
         hex: "#f36f28",
         image: "img/t2.jpg" // مسار صورة الكنزة باللون الرمادي
     },
     {
         name: "اسود",
         hex: "#black",
         image: "img/t3.jpg" // مسار صورة الكنزة باللون الكحلي
     }
 ],
},

];